cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'unrar'
brew 'wget'
brew 'curl'
brew 'yarn'
brew 'git'
brew 'python'
brew 'ansible'
brew 'ansible-lint'
brew 'awscli'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'elixir'
brew 'erlang'
brew 'hugo'
brew 'minio'
brew 'nomad'
brew 'terraform'
brew 'terraform-docs'
brew 'tflint'
brew 'restic'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autocomplete'
brew 'zsh-syntax-highlighting'

# cask '1password'
# cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'vlc'
cask 'firefox-developer-edition'
