cask_args appdir: '/Applications'

# The Taps
tap "getantibody/tap"
tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
tap "lukakerr/things"
tap "minio/stable"
tap "sidaf/pentest"
tap "swinton/brews"

# The Brews
brew "ack"
brew "openssl"
brew "readline"
brew "libyaml"
brew "python"
brew "ansible"
brew "ansible-lint", link: false
brew "aria2"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bfg"
brew "blueutil"
brew "libpng"
brew "gettext"
brew "certbot"
brew "circleci"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "go"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "docker", link: false
brew "docker-compose"
brew "jpeg"
brew "exa"
brew "exercism"
brew "fdupes"
brew "ffmpeg"
brew "fleetctl"
brew "gdrive"
brew "geoip"
brew "gifsicle"
brew "git"
brew "pkg-config"
brew "gradle"
brew "grc"
brew "guetzli"
brew "hugo"
brew "libtool"
brew "imagemagick"
brew "kompose"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "libusb"
brew "libusb-compat"
brew "mas"
brew "nmap"
brew "node"
brew "optipng"
brew "osquery", link: false
brew "packer"
brew "pandoc"
brew "pinentry"
brew "pngquant"
brew "redis"
brew "restic"
brew "s-lang"
brew "swig"
brew "terraform"
brew "terraform-docs"
brew "terragrunt"
brew "unixodbc"
brew "unrar"
brew "vault"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zeromq"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "getantibody/tap/antibody"
brew "minio/stable/mc"
brew "minio/stable/minio"
brew "sidaf/pentest/snmpcheck"
brew "swinton/brews/key2gif"
brew "tflint"
brew "minikube"

# The Casks
cask "firefox"
cask "iina"
cask "insomnia"
cask "java"
cask "pgadmin4"
cask "vagrant"
cask 'vagrant-manager'
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "lukakerr/things/pine"
cask 'alfred'
cask 'hazel'
cask 'google-chrome'
cask 'slack'
cask 'dash'

# The App Stores
#mas "1Password", id: 443987910
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Apple Configurator 2", id: 1037126344
mas "Bear", id: 1091189122
mas "CARROT Weather", id: 993487541
mas "Color Picker", id: 641027709
#mas "Compressor", id: 424390742
#mas "Contacts Cleaner", id: 411369012
mas "DaisyDisk", id: 411643860
#mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
#mas "Final Cut Pro", id: 424389933
mas "ForkLift", id: 412448059
mas "Gemini 2", id: 1090488118
mas "GhosteryLite", id: 1436953057
mas "iA Writer", id: 775737590
mas "JPEGmini Lite", id: 525742250
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
#mas "MindNode", id: 1289197285
#mas "MindNode Pro", id: 402398561
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
#mas "Pocket", id: 568494494
#mas "Polymail", id: 1134717305
#mas "Reeder", id: 880001334
mas "Remote Desktop", id: 409907375
mas "Renamer 5", id: 1063661581
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
#mas "TeamSQL", id: 1427496069
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
#mas "Tweetbot", id: 557168941
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
